package com.cskaoyan.javase.two._0introduction;

/**
 * @description: 二维数组的引入
 * @author: wuguidong@cskaoyan.onaliyun.com
 **/

/**
 * > 引例
 * > 思考以下问题
 * - 一个Java班上有80个人，可以创建一个数组装他们的成绩。
 * - 如果有80个这样的班，怎么办？创建80个数组？
 *
 * > 数组既可以存基本数据类型，也可以存引用数据类型，数组也是引用数据类型
 * 我们可以定义一个数组,去装其他的数组,这种数组套着数组,我们就称之为多维数组
 *
 * 二维数组是最常见的多维数组
 * 它指的是用一个一维数组去装一个一维数组
 *
 *
 * 思考:
 *      1,二维数组在内存中有没有自身独特的结构呢? 没有,它就是一个一维数组
 *      2,二维数组也是只能存储一种数据类型的元素,那么它的数据类型是由什么确定的呢?
 *          二维数组的数据类型是由其中一维数组的数据类型决定的
 *
 */
public class Demo {
}
