package com.cskaoyan.javase.array._0introduction;

/**
 * @description: 数组的引入
 * @author: wuguidong@cskaoyan.onaliyun.com
 **/

/**
 * > 引例
 * - 假设一个班上有80个人，现在需要统计，某一门课程的平均成绩，是否需要定义80个变量？
 * - 编写一个程序，需要储存12个月份的天数，是否要定义12个变量呢？
 * - 编写一个扑克程序，需要储存54张扑克的信息，是否要定义54个变量？
 * - 如果程序需要储存上成千上万的数据，程序员是不是也要逐一定义成千上万个变量呢？
 *
 * 我们需要一个袋子,容器去存放这些有内在联系的变量,让他们变得更容易维护和处理
 * java当中最基本,最基础的容器就是数组
 *
 * 思考：
 * 数组中的数据是胡乱的摆放在一起吗？数组对装在里面的数据有什么要求吗？
 * 数组是存放同种数据类型的有序容器,数组当中的元素都具有相同的数据类型,并且是有序的排列在一起
 * 在数组当中,它的元素是有编号的,编号从0开始,最大值是长度-1
 * 这种编号就称之为数组的下标或者索引(index)
 *
 * 需要注意的事项：
 * - 数组本身是一种引用数据类型
 * - 数组里面，可以存储基本数据类型，也可以存储引用数据类型，但是一个数组里面只能存储一种数据类型
 *
 */
public class Demo {
    public static void main(String[] args) {

    }
}
