package com.cskaoyan.javase.oop1._0introduction;

/**
 * @description: 对象与类的引入
 * @author: wuguidong@cskaoyan.onaliyun.com
 **/

/**
 * > 我们简单总结一下，面向对象就是在模仿我们的现实世界
 *
 * - 类比客观世界的组成：对象是运行中的Java面向对象程序的基本组成单位，类比客观世界中的个体
 * - 类比客观世界个体的描述：对象的属性和行为
 * - 类比客观世界的个体的全体描述（模板）：抽取对象的共性特征形成类
 * - 类抽取出了同种类型的千千万万个对象的属性和行为上的共性(共同特征) ，类就是对象的模板
 *
 * - 类和对象的关系
 *   - 类描述了，同种类型的对象，在属性和行为上的共同特征
 *   - 但是，类只规定了，有什么样的属性，有什么样的行为，但是，对象属性的取值，是由对象自己决定。一个类可以有千千万万不同的对象
 * - 对象与对象的关系
 *   - 不同类生成的对象，属性和行为往往都具有差异，不是同种对象
 *   - 相同类生成的对象，属性和行为具有相似性，但是也完全可能不同
 *
 */
public class Demo {
    public static void main(String[] args) {

    }
}
